rust-course-2019-07-19.org
* Rust: a course under development.
deplotment? There should be a vagrant 

** CALENDAR
*** Day0 - Tools, Motivation
video1 [[Why Rust?]]
Read Chapter 1 of [[The Rust Book]]

Setting up rust: 
https://www.rust-lang.org/tools/install

*** Day1 - Ownership
getting the editor up and running.
https://www.rust-lang.org/tools

clone [[Rustlings]] into [[Course Home Directory]]
video1 [[Hello, World!]] & ex D1E1
video2 [[IntoRust: Ownership]] & ex D1E2

*** Day2 - Ownership
video1 [[Shared Borrows]] & ex D2E1, D2E2
video2 [[Mutable Borrows]] & ex D2E3

Another take.
Memory, Ownership and Borrowing
https://www.youtube.com/watch?v=8M0QfLUDaaA

*** Day3 - Ownership (snoyman's take)
Do Tutorial
+ https://www.snoyman.com/blog/2018/10/rust-crash-course-02-basics-of-ownership
+[[ Scope and Ownership in Rust]]

*** Day ------------------------------------------------------------------
Make sure $editor feature "goto-definition" works.  Need to be
able to see how some common functions are implemented.

in emacs this is bound to <M-.>, which pushes the previous location
onto a stack, which can be popped to go back with <M-,>

Make sure the editor can automatically tell you important type
information about the methods you're working with, such as parameter
types.

Work through Chapter 2 of the book.

*** Day ------------------------------------------------------------------
Chapter 3, Getting a feel for the language, this material will
probably be more familiar.

*** Day
Chapter 4 of the book, take your time.

*** Day
Optimizing Factorial.

*** Day
Chapter [6]
work through PROJECT:1 A Bad Stack

*** Day
Optimizing Matrix Multiplication

*** Day
RustConf 2018 - Benchmarking and Optimization of Rust Libraries by Paul Mason
https://www.youtube.com/watch?v=d2ZQ9-4ZJmQ

- how to import code to benchmark
  https://stackoverflow.com/questions/43998085/how-can-i-use-a-module-from-outside-the-src-folder-in-a-binary-project-such-as

**** Measure.
#[bench]

***** comparing benches from run to run, better than spreadsheets.
- cargo-benchcmp
  (nightly-only)
- criterion
  Has graphs!
  (can run on stable)

***** Microbench
***** Macrobench
***** Bounds checking with sized array
https://youtu.be/d2ZQ9-4ZJmQ?t=1058
LLVM can take advantage of fixed size slices.

keep functions smaller to take advantage of #[inline]

*** Day
exercises for Guard, Rc, Arc, Mutex.

