rust-course-2019-07-19.org
**** Smart Pointers
| Smart Pointers   | Box<T>       | Rc<T>        | RefCell<T> |
|                  |              |              |            |
| #owners          | one          | many         | one        |
| immutable borrow | compile time | compile time | runtime    |
| mutable borrows  | compile time | --           | runtime    |

*** Day
Concurrency: https://www.youtube.com/watch?v=Dbytx0ivH7Q
note: virtual dispatch is the same as dynamic dispatch.

- Guard Type 
- channels
- depends: Rc, Arc, Mutex, thread::spawn,
- Rayon: easy 
- what is 6.005 doing?
- MPMC, multiple producer multiple consumer

Futures: asynch I/O
- highly concurrent

More on concurrency
https://parallel-rust-cpp.github.io

**** What is virtual dispatch in rust?
that's like c++ virtual table, is now called dynamic dispatch.

**** Tokio: mio + futures
- mio cross platform interface
- oneshot channels
- mpsc channel?

**** PROJECTS 
***** Definitely Do:
****** TOO MANY LISTS.
******* 1) A Bad Stack
https://rust-unofficial.github.io/too-many-lists/first-pop.html
******* 2) An Ok Stack  
https://rust-unofficial.github.io/too-many-lists/second.html
******* 3) A persistant Stack  
https://rust-unofficial.github.io/too-many-lists/third.html

***** After TOO MANY LISTS, Implement Skip lists
https://opendatastructures.org/ods-python-screen.pdf

***** Lambda Calculus interpreter
λ. x x

***** After Skip lists, implement red black tree found in Chapter 9
https://opendatastructures.org/ods-python-screen.pdf

***** Create a custom Hasher for HashMap
https://www.131002.net/siphash/siphash.pdf

***** QuadTree
WASM Web field simulator.




** STRUCTURE
*** PEDAGOGY
**** Re-asking original questions from stack overflow, rust forum 
***** What are the differences between Rust's `String` and `str`?
https://stackoverflow.com/questions/24158114/what-are-the-differences-between-rusts-string-and-str/24159933#24159933
***** How to enable/disable assertions in rust programs?
https://doc.rust-lang.org/std/macro.assert.html
Assertions are always checked in both debug and release builds, and
cannot be disabled. See debug_assert! for assertions that are not
enabled in release builds by default.

**** Incrementally Removing Functionality For Guided Projects
So build a full project with lots of tests that work.  At this point
the project is done with 100% test coverage.  On to the teaching part.

Remove the body of a method which will cause tests to fail.
commit this to a git repo.
tag this commit as the <Nth> homework.
tests will pass when the method has been reimplemented the method.

Step 2.

Comment out the failing tests. So the all remaining tests pass.
Remove the body of another method which will cause tests to fail.
commit this to a git repo.
tag this commit as the <N-1)th> homework.
tests will pass when the scholar has implemented the method.

Goto Step 2.

When each method has been commented out, then we're at the beginning
of the project, with a clear and proven step by step path through the
contruction of a program.  With the tests necessary 

Stopping here would be good enough for people who want to learn, but
since git history contains the implementation, it contains all the
information needed to cheat. It would be easy enough to automate
the checkout and wholesale copy of each commit along the way. Then
students could upload solutions and get a keys to the next git commit.

**** Borrow from 6.005 & 6.172
***** 6.172 SPEED.
- Loop Fusion, jamming.
  https://www.youtube.com/watch?time_continue=4232&v=H-1-X9bkop8

- $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$4
  cargo build --release
  cargo asm my_crate::my_function

**** APPROACH
https://github.com/ctjhoa/rust-learning

As for a "From first principles, please spare me the details" 15 week
rust course?

Principle of covering the parts that are strictly necessary and hard
to learn to prevent grasping at straws.

What would Staff do?  rapidly and clearly define abstractions by knowing how
they work, getting practice and moving on to the next. Focusing early
on what's important and only what's necessary to achieve the goal, the
6.004x strategy for building a cpu and understanding how it works in
15 weeks.

Editor agnostic. Use what you want, but support varies by what people
have figured out so far.

assembling excellent pre-existing disparate material.  Overlap is
ok. Licensing is problematic though.  Trim the overlap and give
credit.

 - N topics while minding fast&safe
 + [[DarinM223 : The main concepts in Rust]]

**** Topics
***** Ownership
****** Types of owners 
+ [[Scope and Ownership in Rust]]
- Scopes
- Data and some Types: String, structs, enums, etc. not str.

****** Dependencies
Drop, Lifetime

when does ownership end?  it's called dropping.  what gets dropped?
What actually happens when something is dropped? 
https://doc.rust-lang.org/std/ops/trait.Drop.html

Drop trait. Are integers dropped?
https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=f074df3610670b5a0e1bc9a97856fd36

***** Borrowing
***** Lifetimes
what has a lifetime?

***** Data
****** Slices
****** Enum
****** Structs
****** Vectors
****** Strings
****** HashMaps

***** Design modularity
Coupling
Indirection
Modules
Traits
Closures
Generics

