rust-course-2019-07-19.html
<li><a id="orgffc2537"></a>Smart Pointers<br />
<div class="outline-text-5" id="text-1-1-12-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Smart Pointers</td>
<td class="org-left">Box&lt;T&gt;</td>
<td class="org-left">Rc&lt;T&gt;</td>
<td class="org-left">RefCell&lt;T&gt;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">#owners</td>
<td class="org-left">one</td>
<td class="org-left">many</td>
<td class="org-left">one</td>
</tr>

<tr>
<td class="org-left">immutable borrow</td>
<td class="org-left">compile time</td>
<td class="org-left">compile time</td>
<td class="org-left">runtime</td>
</tr>

<tr>
<td class="org-left">mutable borrows</td>
<td class="org-left">compile time</td>
<td class="org-left">--</td>
<td class="org-left">runtime</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0ab8bb3" class="outline-4">
<h4 id="org0ab8bb3"><span class="section-number-4">1.1.13</span> Day</h4>
<div class="outline-text-4" id="text-1-1-13">
<p>
Concurrency: <a href="https://www.youtube.com/watch?v=Dbytx0ivH7Q">https://www.youtube.com/watch?v=Dbytx0ivH7Q</a>
note: virtual dispatch is the same as dynamic dispatch.
</p>

<ul class="org-ul">
<li>Guard Type</li>
<li>channels</li>
<li>depends: Rc, Arc, Mutex, thread::spawn,</li>
<li>Rayon: easy</li>
<li>what is 6.005 doing?</li>
<li>MPMC, multiple producer multiple consumer</li>
</ul>

<p>
Futures: asynch I/O
</p>
<ul class="org-ul">
<li>highly concurrent</li>
</ul>

<p>
More on concurrency
<a href="https://parallel-rust-cpp.github.io">https://parallel-rust-cpp.github.io</a>
</p>
</div>

<ol class="org-ol">
<li><a id="org9278292"></a>What is virtual dispatch in rust?<br />
<div class="outline-text-5" id="text-1-1-13-1">
<p>
that's like c++ virtual table, is now called dynamic dispatch.
</p>
</div>
</li>

<li><a id="org6fc579d"></a>Tokio: mio + futures<br />
<div class="outline-text-5" id="text-1-1-13-2">
<ul class="org-ul">
<li>mio cross platform interface</li>
<li>oneshot channels</li>
<li>mpsc channel?</li>
</ul>
</div>
</li>

<li><a id="org6feb988"></a>PROJECTS<br />
<ol class="org-ol">
<li><a id="org4959fd9"></a>Definitely Do:<br />
<ol class="org-ol">
<li><a id="orge62a306"></a>TOO MANY LISTS.<br />
<ol class="org-ol">
<li><a id="org77c093c"></a>1) A Bad Stack<br />
<div class="outline-text-8" id="text-1-1-13-3-1-1-1">
<p>
<a href="https://rust-unofficial.github.io/too-many-lists/first-pop.html">https://rust-unofficial.github.io/too-many-lists/first-pop.html</a>
</p>
</div>
</li>
<li><a id="org1269156"></a>2) An Ok Stack<br />
<div class="outline-text-8" id="text-1-1-13-3-1-1-2">
<p>
<a href="https://rust-unofficial.github.io/too-many-lists/second.html">https://rust-unofficial.github.io/too-many-lists/second.html</a>
</p>
</div>
</li>
<li><a id="org0f6bd4e"></a>3) A persistant Stack<br />
<div class="outline-text-8" id="text-1-1-13-3-1-1-3">
<p>
<a href="https://rust-unofficial.github.io/too-many-lists/third.html">https://rust-unofficial.github.io/too-many-lists/third.html</a>
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>

<li><a id="orgf2931c6"></a>After TOO MANY LISTS, Implement Skip lists<br />
<div class="outline-text-6" id="text-1-1-13-3-2">
<p>
<a href="https://opendatastructures.org/ods-python-screen.pdf">https://opendatastructures.org/ods-python-screen.pdf</a>
</p>
</div>
</li>

<li><a id="org6b6301b"></a>Lambda Calculus interpreter<br />
<div class="outline-text-6" id="text-1-1-13-3-3">
<p>
λ. x x
</p>
</div>
</li>

<li><a id="orgcfe127f"></a>After Skip lists, implement red black tree found in Chapter 9<br />
<div class="outline-text-6" id="text-1-1-13-3-4">
<p>
<a href="https://opendatastructures.org/ods-python-screen.pdf">https://opendatastructures.org/ods-python-screen.pdf</a>
</p>
</div>
</li>

<li><a id="orgbc7e00a"></a>Create a custom Hasher for HashMap<br />
<div class="outline-text-6" id="text-1-1-13-3-5">
<p>
<a href="https://www.131002.net/siphash/siphash.pdf">https://www.131002.net/siphash/siphash.pdf</a>
</p>
</div>
</li>

<li><a id="org9fe0c5d"></a>QuadTree<br />
<div class="outline-text-6" id="text-1-1-13-3-6">
<p>
WASM Web field simulator.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>




<div id="outline-container-orgdd63c9b" class="outline-3">
<h3 id="orgdd63c9b"><span class="section-number-3">1.2</span> STRUCTURE</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org9e666f8" class="outline-4">
<h4 id="org9e666f8"><span class="section-number-4">1.2.1</span> PEDAGOGY</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org65d3c6d"></a>Re-asking original questions from stack overflow, rust forum<br />
<ol class="org-ol">
<li><a id="org00f6df6"></a>What are the differences between Rust's `String` and `str`?<br />
<div class="outline-text-6" id="text-1-2-1-1-1">
<p>
<a href="https://stackoverflow.com/questions/24158114/what-are-the-differences-between-rusts-string-and-str/24159933#24159933">https://stackoverflow.com/questions/24158114/what-are-the-differences-between-rusts-string-and-str/24159933#24159933</a>
</p>
</div>
</li>
<li><a id="org66d758b"></a>How to enable/disable assertions in rust programs?<br />
<div class="outline-text-6" id="text-1-2-1-1-2">
<p>
<a href="https://doc.rust-lang.org/std/macro.assert.html">https://doc.rust-lang.org/std/macro.assert.html</a>
Assertions are always checked in both debug and release builds, and
cannot be disabled. See debug<sub>assert</sub>! for assertions that are not
enabled in release builds by default.
</p>
</div>
</li>
</ol>
</li>

<li><a id="org9ce3b35"></a>Incrementally Removing Functionality For Guided Projects<br />
<div class="outline-text-5" id="text-1-2-1-2">
<p>
So build a full project with lots of tests that work.  At this point
the project is done with 100% test coverage.  On to the teaching part.
</p>

<p>
Remove the body of a method which will cause tests to fail.
commit this to a git repo.
tag this commit as the &lt;Nth&gt; homework.
tests will pass when the method has been reimplemented the method.
</p>

<p>
Step 2.
</p>

<p>
Comment out the failing tests. So the all remaining tests pass.
Remove the body of another method which will cause tests to fail.
commit this to a git repo.
tag this commit as the &lt;N-1)th&gt; homework.
tests will pass when the scholar has implemented the method.
</p>

<p>
Goto Step 2.
</p>

<p>
When each method has been commented out, then we're at the beginning
of the project, with a clear and proven step by step path through the
contruction of a program.  With the tests necessary 
</p>

<p>
Stopping here would be good enough for people who want to learn, but
since git history contains the implementation, it contains all the
information needed to cheat. It would be easy enough to automate
the checkout and wholesale copy of each commit along the way. Then
students could upload solutions and get a keys to the next git commit.
</p>
</div>
</li>

<li><a id="org309961f"></a>Borrow from 6.005 &amp; 6.172<br />
<ol class="org-ol">
<li><a id="org8bff4cb"></a>6.172 SPEED.<br />
<div class="outline-text-6" id="text-1-2-1-3-1">
<ul class="org-ul">
<li>Loop Fusion, jamming.
<a href="https://www.youtube.com/watch?time_continue=4232&amp;v=H-1-X9bkop8">https://www.youtube.com/watch?time_continue=4232&amp;v=H-1-X9bkop8</a></li>

<li>\[\]\[\]\[\]\[\]\[\]\[\]\[\]$$4
cargo build &#x2013;release
cargo asm my<sub>crate</sub>::my<sub>function</sub></li>
</ul>
</div>
</li>
</ol>
</li>

<li><a id="org9687629"></a>APPROACH<br />
<div class="outline-text-5" id="text-1-2-1-4">
<p>
<a href="https://github.com/ctjhoa/rust-learning">https://github.com/ctjhoa/rust-learning</a>
</p>

<p>
As for a "From first principles, please spare me the details" 15 week
rust course?
</p>

<p>
Principle of covering the parts that are strictly necessary and hard
to learn to prevent grasping at straws.
</p>

<p>
What would Staff do?  rapidly and clearly define abstractions by knowing how
they work, getting practice and moving on to the next. Focusing early
on what's important and only what's necessary to achieve the goal, the
6.004x strategy for building a cpu and understanding how it works in
15 weeks.
</p>

<p>
Editor agnostic. Use what you want, but support varies by what people
have figured out so far.
</p>

<p>
assembling excellent pre-existing disparate material.  Overlap is
ok. Licensing is problematic though.  Trim the overlap and give
credit.
</p>

<ul class="org-ul">
<li>N topics while minding fast&amp;safe</li>
<li><a href="#orgdb82546">1.4.3.6</a></li>
</ul>
</div>
</li>

<li><a id="org2d754f1"></a>Topics<br />
<ol class="org-ol">
<li><a id="org16fbf8a"></a>Ownership<br />
<ol class="org-ol">
<li><a id="org18ad16f"></a>Types of owners<br />
<div class="outline-text-7" id="text-1-2-1-5-1-1">
<ul class="org-ul">
<li><a href="#org6e13c85">1.4.3.9</a></li>
<li>Scopes</li>
<li>Data and some Types: String, structs, enums, etc. not str.</li>
</ul>
</div>
</li>

<li><a id="org9e3e2a7"></a>Dependencies<br />
<div class="outline-text-7" id="text-1-2-1-5-1-2">
<p>
Drop, Lifetime
</p>

<p>
when does ownership end?  it's called dropping.  what gets dropped?
What actually happens when something is dropped? 
<a href="https://doc.rust-lang.org/std/ops/trait.Drop.html">https://doc.rust-lang.org/std/ops/trait.Drop.html</a>
</p>

<p>
Drop trait. Are integers dropped?
<a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=f074df3610670b5a0e1bc9a97856fd36">https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=f074df3610670b5a0e1bc9a97856fd36</a>
</p>
</div>
</li>
</ol>
</li>

<li><a id="orgd14e5c4"></a>Borrowing<br /></li>
<li><a id="orgd2b56dd"></a>Lifetimes<br />
<div class="outline-text-6" id="text-1-2-1-5-3">
<p>
what has a lifetime?
</p>
</div>
</li>

<li><a id="org19ad01a"></a>Data<br />
<ol class="org-ol">
<li><a id="orga999af6"></a>Slices<br /></li>
<li><a id="orgf1736e3"></a>Enum<br /></li>
<li><a id="org1b92c8e"></a>Structs<br /></li>
<li><a id="org506385e"></a>Vectors<br /></li>
<li><a id="org6a4e467"></a>Strings<br /></li>
<li><a id="org7dacea7"></a>HashMaps<br /></li>
</ol>
</li>

<li><a id="org017b503"></a>Design modularity<br />
<div class="outline-text-6" id="text-1-2-1-5-5">
<p>
Coupling
Indirection
Modules
Traits
Closures
Generics
</p>
</div>
</li>
