rust-course-2019-07-19.org
***** Testing as you go
https://doc.rust-lang.org/book/ch12-04-testing-the-librarys-functionality.html


***** each concept has 3 exercises
***** each exercise views the concept 3 ways

**** General Programming concepts in rust
Mutability
Modules


**** How deep to go on these data structures?
Why not spend a whole day on each one? Learn how to study how the data
structures work, then people will know how to learn how to study how
other data structures work.

** INFO
*** Course Home Directory
This refers to the root directory of the course, you'll have to pick a
place, anywhere will do.

mkdir -p ~/courses/rust-fast-and-safe

** REFERENCES
*** Books
**** Rust Books
***** The Rust Book
https://doc.rust-lang.org/book/
***** The Rustonomicon 
https://doc.rust-lang.org/nomicon/
***** The Rust cookbook
https://rust-lang-nursery.github.io/rust-cookbook
***** Rust By Example
https://doc.rust-lang.org/rust-by-example/fn/closures.html
***** The Cargo Book
https://doc.rust-lang.org/cargo/index.html
**** Other Books
***** Open Data Structures
https://opendatastructures.org/ods-python-screen.pdf
*** Video (in no particular order)
**** Why Rust? 
http://intorust.com/tutorial/why-rust/
**** Hello, World!
http://intorust.com/tutorial/hello-world/
**** IntoRust: Ownership
http://intorust.com/tutorial/ownership/
**** Ownership in Rust with Carol Nichols and Jake Goulding
https://www.youtube.com/watch?v=iV4x_2tcVT8
**** Rust Programming Techniques
https://www.youtube.com/watch?v=vqavdUGKeb4
Exercise @ 54:55

*** Pages
**** Official Rust Home
https://doc.rust-lang.org/

**** Into Rust
http://intorust.com/

**** Rustlings
https://github.com/rust-lang/rustlings/

**** Snoyman's Rust Crash Course
***** Basics of ownership 1
https://www.snoyman.com/series/rust-crash-course

SOLUTIONS:
https://www.snoyman.com/blog/2018/10/rust-crash-course-02-basics-of-ownership-solutions

**** Rust Tutorial 2014
http://pnkfx.org/rust-examples-icfp2014/

**** DarinM223 : The main concepts in Rust
https://gist.github.com/DarinM223/e7237114cfdcf3644f90
**** Guidelines on Benchmarking and Rust
https://nbsoftsolutions.com/blog/guidelines-on-benchmarking-and-rust
**** Doc Tests
https://doc.rust-lang.org/rustdoc/documentation-tests.html
**** Scope and Ownership in Rust
https://tutorialedge.net/rust/scope-ownership-in-rust/
***** Exercises
****** Demonstrating life times by storing references in collections
****** Implementing 6 types of linked lists.
https://rust-unofficial.github.io/too-many-lists/first-pop.html
******* notes:
1) quickly skimmed introduction

next, don't copy paste these exercises type it all in,
- chapter 2: a bad stack
- chapter 3: a bad stack

/home/derek/dev/rust-projects/lists


***** Memory
****** Facets
Aliasing, how many pointers have this address?
****** Pointers
******* What is a box?
uses global allocator
https://doc.rust-lang.org/std/boxed/index.html
A pointer type for heap allocation.

******* Smart Pointers
******** RC a reference counted type enabling multiple ownership
******** Arc
********* https://doc.rust-lang.org/std/sync/struct.Arc.html
The type Arc<T> provides shared ownership of a value of type T,
allocated in the heap. Invoking clone on Arc produces a new Arc
instance, which points to the same value on the heap as the source
Arc, while increasing a reference count. When the last Arc pointer to
a given value is destroyed, the pointed-to value is also destroyed.

Shared references in Rust disallow mutation by default, and Arc is no
exception: you cannot generally obtain a mutable reference to
something inside an Arc. If you need to mutate through an Arc, use
Mutex, RwLock, or one of the Atomic types.
******** Cell
https://doc.rust-lang.org/stable/std/cell/index.html
https://manishearth.github.io/blog/2015/05/27/wrapper-types-in-rust-choosing-your-guarantees/
********* SafeCell
********** RefCell
********** Cell

********* UnsafeCell

**** Raw string literals!
https://rahul-thakoor.github.io/rust-raw-string-literals/

**** Splitting Borrows
https://doc.rust-lang.org/nomicon/borrow-splitting.html

**** Turbofish
https://techblog.tonsser.com/posts/what-is-rusts-turbofish

**** Myths Programmers Believe about CPU Caches
https://software.rajivprab.com/2018/04/29/myths-programmers-believe-about-cpu-caches
/
** Vocab
*** [[Turbofish]]
