rust-course-2019-07-19.html

<li><a id="org6b1c137"></a>Testing as you go<br />
<div class="outline-text-6" id="text-1-2-1-5-6">
<p>
<a href="https://doc.rust-lang.org/book/ch12-04-testing-the-librarys-functionality.html">https://doc.rust-lang.org/book/ch12-04-testing-the-librarys-functionality.html</a>
</p>
</div>
</li>


<li><a id="org316ce38"></a>each concept has 3 exercises<br /></li>
<li><a id="org44bc442"></a>each exercise views the concept 3 ways<br /></li>
</ol>
</li>

<li><a id="org8554e9b"></a>General Programming concepts in rust<br />
<div class="outline-text-5" id="text-1-2-1-6">
<p>
Mutability
Modules
</p>
</div>
</li>


<li><a id="org0c4238a"></a>How deep to go on these data structures?<br />
<div class="outline-text-5" id="text-1-2-1-7">
<p>
Why not spend a whole day on each one? Learn how to study how the data
structures work, then people will know how to learn how to study how
other data structures work.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgde4c1e3" class="outline-3">
<h3 id="orgde4c1e3"><span class="section-number-3">1.3</span> INFO</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org5be1cfc" class="outline-4">
<h4 id="org5be1cfc"><span class="section-number-4">1.3.1</span> Course Home Directory</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
This refers to the root directory of the course, you'll have to pick a
place, anywhere will do.
</p>

<p>
mkdir -p ~/courses/rust-fast-and-safe
</p>
</div>
</div>
</div>

<div id="outline-container-orgd4d1482" class="outline-3">
<h3 id="orgd4d1482"><span class="section-number-3">1.4</span> REFERENCES</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org403802d" class="outline-4">
<h4 id="org403802d"><span class="section-number-4">1.4.1</span> Books</h4>
<div class="outline-text-4" id="text-1-4-1">
</div>
<ol class="org-ol">
<li><a id="org75ecf6d"></a>Rust Books<br />
<ol class="org-ol">
<li><a id="org48d80fd"></a>The Rust Book<br />
<div class="outline-text-6" id="text-1-4-1-1-1">
<p>
<a href="https://doc.rust-lang.org/book/">https://doc.rust-lang.org/book/</a>
</p>
</div>
</li>
<li><a id="org7480f88"></a>The Rustonomicon<br />
<div class="outline-text-6" id="text-1-4-1-1-2">
<p>
<a href="https://doc.rust-lang.org/nomicon/">https://doc.rust-lang.org/nomicon/</a>
</p>
</div>
</li>
<li><a id="orgec73c82"></a>The Rust cookbook<br />
<div class="outline-text-6" id="text-1-4-1-1-3">
<p>
<a href="https://rust-lang-nursery.github.io/rust-cookbook">https://rust-lang-nursery.github.io/rust-cookbook</a>
</p>
</div>
</li>
<li><a id="org823955d"></a>Rust By Example<br />
<div class="outline-text-6" id="text-1-4-1-1-4">
<p>
<a href="https://doc.rust-lang.org/rust-by-example/fn/closures.html">https://doc.rust-lang.org/rust-by-example/fn/closures.html</a>
</p>
</div>
</li>
<li><a id="org701f758"></a>The Cargo Book<br />
<div class="outline-text-6" id="text-1-4-1-1-5">
<p>
<a href="https://doc.rust-lang.org/cargo/index.html">https://doc.rust-lang.org/cargo/index.html</a>
</p>
</div>
</li>
</ol>
</li>
<li><a id="org525c7a5"></a>Other Books<br />
<ol class="org-ol">
<li><a id="orgbe5725e"></a>Open Data Structures<br />
<div class="outline-text-6" id="text-1-4-1-2-1">
<p>
<a href="https://opendatastructures.org/ods-python-screen.pdf">https://opendatastructures.org/ods-python-screen.pdf</a>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org798fe1d" class="outline-4">
<h4 id="org798fe1d"><span class="section-number-4">1.4.2</span> Video (in no particular order)</h4>
<div class="outline-text-4" id="text-1-4-2">
</div>
<ol class="org-ol">
<li><a id="org5cfdfd2"></a>Why Rust?<br />
<div class="outline-text-5" id="text-1-4-2-1">
<p>
<a href="http://intorust.com/tutorial/why-rust/">http://intorust.com/tutorial/why-rust/</a>
</p>
</div>
</li>
<li><a id="org2b631e9"></a>Hello, World!<br />
<div class="outline-text-5" id="text-1-4-2-2">
<p>
<a href="http://intorust.com/tutorial/hello-world/">http://intorust.com/tutorial/hello-world/</a>
</p>
</div>
</li>
<li><a id="orge07268c"></a>IntoRust: Ownership<br />
<div class="outline-text-5" id="text-1-4-2-3">
<p>
<a href="http://intorust.com/tutorial/ownership/">http://intorust.com/tutorial/ownership/</a>
</p>
</div>
</li>
<li><a id="org31e86ff"></a>Ownership in Rust with Carol Nichols and Jake Goulding<br />
<div class="outline-text-5" id="text-1-4-2-4">
<p>
<a href="https://www.youtube.com/watch?v=iV4x_2tcVT8">https://www.youtube.com/watch?v=iV4x_2tcVT8</a>
</p>
</div>
</li>
<li><a id="org9d18a30"></a>Rust Programming Techniques<br />
<div class="outline-text-5" id="text-1-4-2-5">
<p>
<a href="https://www.youtube.com/watch?v=vqavdUGKeb4">https://www.youtube.com/watch?v=vqavdUGKeb4</a>
Exercise @ 54:55
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org6076653" class="outline-4">
<h4 id="org6076653"><span class="section-number-4">1.4.3</span> Pages</h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<ol class="org-ol">
<li><a id="org0604e94"></a>Official Rust Home<br />
<div class="outline-text-5" id="text-1-4-3-1">
<p>
<a href="https://doc.rust-lang.org/">https://doc.rust-lang.org/</a>
</p>
</div>
</li>

<li><a id="orgc3c38c9"></a>Into Rust<br />
<div class="outline-text-5" id="text-1-4-3-2">
<p>
<a href="http://intorust.com/">http://intorust.com/</a>
</p>
</div>
</li>

<li><a id="org1ec3a93"></a>Rustlings<br />
<div class="outline-text-5" id="text-1-4-3-3">
<p>
<a href="https://github.com/rust-lang/rustlings/">https://github.com/rust-lang/rustlings/</a>
</p>
</div>
</li>

<li><a id="org92cb1fe"></a>Snoyman's Rust Crash Course<br />
<ol class="org-ol">
<li><a id="orga48bf68"></a>Basics of ownership 1<br />
<div class="outline-text-6" id="text-1-4-3-4-1">
<p>
<a href="https://www.snoyman.com/series/rust-crash-course">https://www.snoyman.com/series/rust-crash-course</a>
</p>

<p>
SOLUTIONS:
<a href="https://www.snoyman.com/blog/2018/10/rust-crash-course-02-basics-of-ownership-solutions">https://www.snoyman.com/blog/2018/10/rust-crash-course-02-basics-of-ownership-solutions</a>
</p>
</div>
</li>
</ol>
</li>

<li><a id="org9e56e40"></a>Rust Tutorial 2014<br />
<div class="outline-text-5" id="text-1-4-3-5">
<p>
<a href="http://pnkfx.org/rust-examples-icfp2014/">http://pnkfx.org/rust-examples-icfp2014/</a>
</p>
</div>
</li>

<li><a id="orgdb82546"></a>DarinM223 : The main concepts in Rust<br />
<div class="outline-text-5" id="text-1-4-3-6">
<p>
<a href="https://gist.github.com/DarinM223/e7237114cfdcf3644f90">https://gist.github.com/DarinM223/e7237114cfdcf3644f90</a>
</p>
</div>
</li>
<li><a id="org1dbc424"></a>Guidelines on Benchmarking and Rust<br />
<div class="outline-text-5" id="text-1-4-3-7">
<p>
<a href="https://nbsoftsolutions.com/blog/guidelines-on-benchmarking-and-rust">https://nbsoftsolutions.com/blog/guidelines-on-benchmarking-and-rust</a>
</p>
</div>
</li>
<li><a id="org26ec138"></a>Doc Tests<br />
<div class="outline-text-5" id="text-1-4-3-8">
<p>
<a href="https://doc.rust-lang.org/rustdoc/documentation-tests.html">https://doc.rust-lang.org/rustdoc/documentation-tests.html</a>
</p>
</div>
</li>
<li><a id="org6e13c85"></a>Scope and Ownership in Rust<br />
<div class="outline-text-5" id="text-1-4-3-9">
<p>
<a href="https://tutorialedge.net/rust/scope-ownership-in-rust/">https://tutorialedge.net/rust/scope-ownership-in-rust/</a>
</p>
</div>
<ol class="org-ol">
<li><a id="orgbc3832a"></a>Exercises<br />
<ol class="org-ol">
<li><a id="orgace96a2"></a>Demonstrating life times by storing references in collections<br /></li>
<li><a id="org067b4d3"></a>Implementing 6 types of linked lists.<br />
<div class="outline-text-7" id="text-1-4-3-9-1-2">
<p>
<a href="https://rust-unofficial.github.io/too-many-lists/first-pop.html">https://rust-unofficial.github.io/too-many-lists/first-pop.html</a>
</p>
</div>
<ol class="org-ol">
<li><a id="orga44b847"></a>notes:<br />
<div class="outline-text-8" id="text-1-4-3-9-1-2-1">
<ol class="org-ol">
<li>quickly skimmed introduction</li>
</ol>

<p>
next, don't copy paste these exercises type it all in,
</p>
<ul class="org-ul">
<li>chapter 2: a bad stack</li>
<li>chapter 3: a bad stack</li>
</ul>

<p>
/home/derek/dev/rust-projects/lists
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="org9ad1dbd"></a>Memory<br />
<ol class="org-ol">
<li><a id="orgb359d3e"></a>Facets<br />
<div class="outline-text-7" id="text-1-4-3-9-2-1">
<p>
Aliasing, how many pointers have this address?
</p>
</div>
</li>
<li><a id="orga324c98"></a>Pointers<br />
<ol class="org-ol">
<li><a id="org939c823"></a>What is a box?<br />
<div class="outline-text-8" id="text-1-4-3-9-2-2-1">
<p>
uses global allocator
<a href="https://doc.rust-lang.org/std/boxed/index.html">https://doc.rust-lang.org/std/boxed/index.html</a>
A pointer type for heap allocation.
</p>
</div>
</li>

<li><a id="orgee75fd9"></a>Smart Pointers<br />
<ol class="org-ol">
<li><a id="org3074135"></a>RC a reference counted type enabling multiple ownership<br /></li>
<li><a id="org54e22dc"></a>Arc<br />
<ol class="org-ol">
<li><a id="org31f7f49"></a><a href="https://doc.rust-lang.org/std/sync/struct.Arc.html">https://doc.rust-lang.org/std/sync/struct.Arc.html</a><br />
<div class="outline-text-10" id="text-1-4-3-9-2-2-2-2-1">
<p>
The type Arc&lt;T&gt; provides shared ownership of a value of type T,
allocated in the heap. Invoking clone on Arc produces a new Arc
instance, which points to the same value on the heap as the source
Arc, while increasing a reference count. When the last Arc pointer to
a given value is destroyed, the pointed-to value is also destroyed.
</p>

<p>
Shared references in Rust disallow mutation by default, and Arc is no
exception: you cannot generally obtain a mutable reference to
something inside an Arc. If you need to mutate through an Arc, use
Mutex, RwLock, or one of the Atomic types.
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgdc8c264"></a>Cell<br />
<div class="outline-text-9" id="text-1-4-3-9-2-2-2-3">
<p>
<a href="https://doc.rust-lang.org/stable/std/cell/index.html">https://doc.rust-lang.org/stable/std/cell/index.html</a>
<a href="https://manishearth.github.io/blog/2015/05/27/wrapper-types-in-rust-choosing-your-guarantees/">https://manishearth.github.io/blog/2015/05/27/wrapper-types-in-rust-choosing-your-guarantees/</a>
</p>
</div>
<ol class="org-ol">
<li><a id="org9e47fe8"></a>SafeCell<br />
<ol class="org-ol">
<li><a id="orgc9ef3ec"></a>RefCell<br /></li>
<li><a id="org8d92618"></a>Cell<br /></li>
</ol>
</li>

<li><a id="org4de603b"></a>UnsafeCell<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>

<li><a id="orgd7aa21a"></a>Raw string literals!<br />
<div class="outline-text-5" id="text-1-4-3-10">
<p>
<a href="https://rahul-thakoor.github.io/rust-raw-string-literals/">https://rahul-thakoor.github.io/rust-raw-string-literals/</a>
</p>
</div>
</li>

<li><a id="org6f533cd"></a>Splitting Borrows<br />
<div class="outline-text-5" id="text-1-4-3-11">
<p>
<a href="https://doc.rust-lang.org/nomicon/borrow-splitting.html">https://doc.rust-lang.org/nomicon/borrow-splitting.html</a>
</p>
</div>
</li>

<li><a id="orgadc0fb9"></a>Turbofish<br />
<div class="outline-text-5" id="text-1-4-3-12">
<p>
<a href="https://techblog.tonsser.com/posts/what-is-rusts-turbofish">https://techblog.tonsser.com/posts/what-is-rusts-turbofish</a>
</p>
</div>
</li>

<li><a id="orgb9928de"></a>Myths Programmers Believe about CPU Caches<br />
<div class="outline-text-5" id="text-1-4-3-13">
<p>
<a href="https://software.rajivprab.com/2018/04/29/myths-programmers-believe-about-cpu-caches">https://software.rajivprab.com/2018/04/29/myths-programmers-believe-about-cpu-caches</a>
/
</p>
</div>
</li>
</ol>
</div>
</div>
