rust-course-2019-07-19.org
*** [[Splitting Borrows]]
*** Deref Coercion
https://doc.rust-lang.org/book/ch15-02-deref.html


** Rustonomicon - Iterating over mutable references to elements in a vector
https://doc.rust-lang.org/stable/nomicon/vec.html.

```rust
let mut v = vec![100, 32, 57];
for i in &mut v {
    *i += 50;
}
Listing 8-9: Iterating over mutable references to elements in a vector
```

** Chapter 10
*** Blanket Implementations
impl<T: Display> ToString for T {
    // --snip--
}

∀x, x∊Display, fn ToString<x> 

in haskell syntax.

class (Display a) => ToString a where
    display :: a -> String

** TOOLS
running tests on code changes
https://github.com/passcod/cargo-watch

** Questions
*** Chapter7
**** What's the difference between packages and crates?
A crate is a binary or library

A package is one or more crates that provide a set of functionality. A
package contains a Cargo.toml file that describes how to build those
crates.

crates.io is an unfortunate name, should be packages.io.

**** What's the deal with modules?
***** How do I, #include "./point.h"

For programs with a main() function (i.e. not libraries)

// main.rs -----------------
mod point;  // introduce the module declared in point.rs 

use crate::point;

fn main() {
    let p1 = Point::new(2, 4);
}

**** Chapter14
***** What's a workspace?
***** mod is overloaded, it can mean
- append a local module's path onto crate:: 
- declare a module
***** files without mod keyword implictity declare module.

** Objective
Lifetimes, dangling references. This page is important for learning.
https://doc.rust-lang.org/book/ch10-03-lifetime-syntax.html

The first half is going to be about safety. The second half will be
about profiling and when unsafe is the right way to go.

** PERFORMANCE
let mut xs = Vec::with_capacity(123); // note: goto def and see how it's implemented.
xs.resize(123, 0) // xs now contains 123 zeros.
replaces malloc dance
https://doc.rust-lang.org/std/vec/struct.Vec.html


** Owned Types in structs.
https://doc.rust-lang.org/book/ch05-01-defining-structs.html#ownership-of-struct-data
"In the User struct definition in Listing 5-1, we used the owned
String type rather than the &str string slice type. This is a
deliberate choice because we want instances of this struct to own all
of its data and for that data to be valid for as long as the entire
struct is valid."


** Old topic ideas.
| Weeks | Difficulty | Topics                                                 |
|-------+------------+--------------------------------------------------------|
| ?     |          2 | Project focus, CPU emulator                            |
| ?     |          2 | Algebraic types and ERROR HANDLING.                    |
| ?     |          1 | Slices, Arrays and Vecs                                |
| ?     |          1 | Strings inside and out , UTF8                          |
| ?     |          2 | Memory: Heap, Ownership, borrowing ~ aliasing          |
| ?     |          2 | Memory: Lifetime Specifiers                            |
| ?     |          4 | Memory: Closures and Generics                          |
| ?     |          3 | Memory: Generics and impossible thinking?              |
| ?     |          5 | Design Challegenes with type system:                   |
| ?     |          3 | Broaching unsafe                                       |
| ?     |          4 | Memory: Safer Concurrency                              |
| ?     |          5 | Design Challegenes with type system: Concurrency       |
| ?     |          5 | Tradeoffs profiling and optimizing, matching           |
| ?     |          2 | Project focus                                          |
| ?     |          2 | Type Inference?, Hindley Milner?, How does rust do it? |
| ?     |          1 | brain cool down: realworld FFI                         |
| ?     |          1 | brain cool down: Macros                                |
|-------+------------+--------------------------------------------------------|

highlight differences: IF statement or IF expression?


*** Ownership
http://intorust.com/tutorial/ownership/

*** Null
**** problems with null.
http://wiki.c2.com/?WhatIsNull
http://cs242.stanford.edu/f18/lectures/05-1-rust-memory-safety.html
**** rust doesn't allow them

** Practical Stuff
*** Setting up Editor
https://areweideyet.com
**** Rust Language Server
https://www.mortens.dev/blog/emacs-and-the-language-server-protocol/

*** Editor Considerations
**** Editing rustdoc comments in emacs
https://boinkor.net/2018/10/editing-rustdoc-comments-in-emacs/

