rust-course-2019-07-19.html
<div id="outline-container-org71b4d36" class="outline-3">
<h3 id="org71b4d36"><span class="section-number-3">1.5</span> Vocab</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org20e0192" class="outline-4">
<h4 id="org20e0192"><span class="section-number-4">1.5.1</span> <a href="#orgadc0fb9">1.4.3.12</a></h4>
</div>
<div id="outline-container-orgcb5d62e" class="outline-4">
<h4 id="orgcb5d62e"><span class="section-number-4">1.5.2</span> <a href="#org6f533cd">1.4.3.11</a></h4>
</div>
<div id="outline-container-org154c121" class="outline-4">
<h4 id="org154c121"><span class="section-number-4">1.5.3</span> Deref Coercion</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
<a href="https://doc.rust-lang.org/book/ch15-02-deref.html">https://doc.rust-lang.org/book/ch15-02-deref.html</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org42e3580" class="outline-3">
<h3 id="org42e3580"><span class="section-number-3">1.6</span> Rustonomicon - Iterating over mutable references to elements in a vector</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="https://doc.rust-lang.org/stable/nomicon/vec.html">https://doc.rust-lang.org/stable/nomicon/vec.html</a>.
</p>

<p>
```rust
let mut v = vec![100, 32, 57];
for i in &amp;mut v {
    *i += 50;
}
Listing 8-9: Iterating over mutable references to elements in a vector
```
</p>
</div>
</div>

<div id="outline-container-org2467363" class="outline-3">
<h3 id="org2467363"><span class="section-number-3">1.7</span> Chapter 10</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org6d7af75" class="outline-4">
<h4 id="org6d7af75"><span class="section-number-4">1.7.1</span> Blanket Implementations</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
impl&lt;T: Display&gt; ToString for T {
    // &#x2013;snip&#x2013;
}
</p>

<p>
∀x, x∊Display, fn ToString&lt;x&gt; 
</p>

<p>
in haskell syntax.
</p>

<p>
class (Display a) =&gt; ToString a where
    display :: a -&gt; String
</p>
</div>
</div>
</div>

<div id="outline-container-org7d1d7e1" class="outline-3">
<h3 id="org7d1d7e1"><span class="section-number-3">1.8</span> TOOLS</h3>
<div class="outline-text-3" id="text-1-8">
<p>
running tests on code changes
<a href="https://github.com/passcod/cargo-watch">https://github.com/passcod/cargo-watch</a>
</p>
</div>
</div>

<div id="outline-container-org7b53da5" class="outline-3">
<h3 id="org7b53da5"><span class="section-number-3">1.9</span> Questions</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-org3cc8d3f" class="outline-4">
<h4 id="org3cc8d3f"><span class="section-number-4">1.9.1</span> Chapter7</h4>
<div class="outline-text-4" id="text-1-9-1">
</div>
<ol class="org-ol">
<li><a id="orgfd781e6"></a>What's the difference between packages and crates?<br />
<div class="outline-text-5" id="text-1-9-1-1">
<p>
A crate is a binary or library
</p>

<p>
A package is one or more crates that provide a set of functionality. A
package contains a Cargo.toml file that describes how to build those
crates.
</p>

<p>
crates.io is an unfortunate name, should be packages.io.
</p>
</div>
</li>

<li><a id="org4bcb61e"></a>What's the deal with modules?<br />
<ol class="org-ol">
<li><a id="org026607f"></a>How do I, #include "./point.h"<br />
<div class="outline-text-6" id="text-1-9-1-2-1">
<p>
For programs with a main() function (i.e. not libraries)
</p>

<p>
<i>/ main.rs ------------&#x2013;&#x2014;
mod point;  /</i> introduce the module declared in point.rs 
</p>

<p>
use crate::point;
</p>

<p>
fn main() {
    let p1 = Point::new(2, 4);
}
</p>
</div>
</li>
</ol>
</li>

<li><a id="org4f1ed1b"></a>Chapter14<br />
<ol class="org-ol">
<li><a id="org744c999"></a>What's a workspace?<br /></li>
<li><a id="org6599ada"></a>mod is overloaded, it can mean<br />
<div class="outline-text-6" id="text-1-9-1-3-2">
<ul class="org-ul">
<li>append a local module's path onto crate::</li>
<li>declare a module</li>
</ul>
</div>
</li>
<li><a id="org83d6307"></a>files without mod keyword implictity declare module.<br /></li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgf2daa93" class="outline-3">
<h3 id="orgf2daa93"><span class="section-number-3">1.10</span> Objective</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Lifetimes, dangling references. This page is important for learning.
<a href="https://doc.rust-lang.org/book/ch10-03-lifetime-syntax.html">https://doc.rust-lang.org/book/ch10-03-lifetime-syntax.html</a>
</p>

<p>
The first half is going to be about safety. The second half will be
about profiling and when unsafe is the right way to go.
</p>
</div>
</div>

<div id="outline-container-org142ed0a" class="outline-3">
<h3 id="org142ed0a"><span class="section-number-3">1.11</span> PERFORMANCE</h3>
<div class="outline-text-3" id="text-1-11">
<p>
let mut xs = Vec::with<sub>capacity</sub>(123); <i>/ note: goto def and see how it's implemented.
xs.resize(123, 0) /</i> xs now contains 123 zeros.
replaces malloc dance
<a href="https://doc.rust-lang.org/std/vec/struct.Vec.html">https://doc.rust-lang.org/std/vec/struct.Vec.html</a>
</p>
</div>
</div>


<div id="outline-container-orga31b98b" class="outline-3">
<h3 id="orga31b98b"><span class="section-number-3">1.12</span> Owned Types in structs.</h3>
<div class="outline-text-3" id="text-1-12">
<p>
<a href="https://doc.rust-lang.org/book/ch05-01-defining-structs.html#ownership-of-struct-data">https://doc.rust-lang.org/book/ch05-01-defining-structs.html#ownership-of-struct-data</a>
"In the User struct definition in Listing 5-1, we used the owned
String type rather than the &amp;str string slice type. This is a
deliberate choice because we want instances of this struct to own all
of its data and for that data to be valid for as long as the entire
struct is valid."
</p>
</div>
</div>


<div id="outline-container-org1f01995" class="outline-3">
<h3 id="org1f01995"><span class="section-number-3">1.13</span> Old topic ideas.</h3>
<div class="outline-text-3" id="text-1-13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Weeks</th>
<th scope="col" class="org-right">Difficulty</th>
<th scope="col" class="org-left">Topics</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">?</td>
<td class="org-right">2</td>
<td class="org-left">Project focus, CPU emulator</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">2</td>
<td class="org-left">Algebraic types and ERROR HANDLING.</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">1</td>
<td class="org-left">Slices, Arrays and Vecs</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">1</td>
<td class="org-left">Strings inside and out , UTF8</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">2</td>
<td class="org-left">Memory: Heap, Ownership, borrowing ~ aliasing</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">2</td>
<td class="org-left">Memory: Lifetime Specifiers</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">4</td>
<td class="org-left">Memory: Closures and Generics</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">3</td>
<td class="org-left">Memory: Generics and impossible thinking?</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">5</td>
<td class="org-left">Design Challegenes with type system:</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">3</td>
<td class="org-left">Broaching unsafe</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">4</td>
<td class="org-left">Memory: Safer Concurrency</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">5</td>
<td class="org-left">Design Challegenes with type system: Concurrency</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">5</td>
<td class="org-left">Tradeoffs profiling and optimizing, matching</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">2</td>
<td class="org-left">Project focus</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">2</td>
<td class="org-left">Type Inference?, Hindley Milner?, How does rust do it?</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">1</td>
<td class="org-left">brain cool down: realworld FFI</td>
</tr>

<tr>
<td class="org-left">?</td>
<td class="org-right">1</td>
<td class="org-left">brain cool down: Macros</td>
</tr>
</tbody>
</table>

<p>
highlight differences: IF statement or IF expression?
</p>
</div>


<div id="outline-container-org5db646c" class="outline-4">
<h4 id="org5db646c"><span class="section-number-4">1.13.1</span> Ownership</h4>
<div class="outline-text-4" id="text-1-13-1">
<p>
<a href="http://intorust.com/tutorial/ownership/">http://intorust.com/tutorial/ownership/</a>
</p>
</div>
</div>

<div id="outline-container-orgcb037aa" class="outline-4">
<h4 id="orgcb037aa"><span class="section-number-4">1.13.2</span> Null</h4>
<div class="outline-text-4" id="text-1-13-2">
</div>
<ol class="org-ol">
<li><a id="orgf4d97d9"></a>problems with null.<br />
<div class="outline-text-5" id="text-1-13-2-1">
<p>
<a href="http://wiki.c2.com/?WhatIsNull">http://wiki.c2.com/?WhatIsNull</a>
<a href="http://cs242.stanford.edu/f18/lectures/05-1-rust-memory-safety.html">http://cs242.stanford.edu/f18/lectures/05-1-rust-memory-safety.html</a>
</p>
</div>
</li>
<li><a id="org21e268d"></a>rust doesn't allow them<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgbafd76c" class="outline-3">
<h3 id="orgbafd76c"><span class="section-number-3">1.14</span> Practical Stuff</h3>
<div class="outline-text-3" id="text-1-14">
</div>
<div id="outline-container-org1f280d6" class="outline-4">
<h4 id="org1f280d6"><span class="section-number-4">1.14.1</span> Setting up Editor</h4>
<div class="outline-text-4" id="text-1-14-1">
<p>
<a href="https://areweideyet.com">https://areweideyet.com</a>
</p>
</div>
<ol class="org-ol">
<li><a id="orgfe341f3"></a>Rust Language Server<br />
<div class="outline-text-5" id="text-1-14-1-1">
<p>
<a href="https://www.mortens.dev/blog/emacs-and-the-language-server-protocol/">https://www.mortens.dev/blog/emacs-and-the-language-server-protocol/</a>
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2a96352" class="outline-4">
<h4 id="org2a96352"><span class="section-number-4">1.14.2</span> Editor Considerations</h4>
<div class="outline-text-4" id="text-1-14-2">
</div>
<ol class="org-ol">
<li><a id="org18cc418"></a>Editing rustdoc comments in emacs<br />
<div class="outline-text-5" id="text-1-14-2-1">
<p>
<a href="https://boinkor.net/2018/10/editing-rustdoc-comments-in-emacs/">https://boinkor.net/2018/10/editing-rustdoc-comments-in-emacs/</a>
</p>
</div>
</li>
