rust-course-2019-07-19.org
**** Editor editions
It couldn't be taught in emacs, that's for sure.  An editor with
shallow learning curve that covers the basics without being painful,
that's a TODO: find good easy editor.  Then tackle the underlying
theory, (like the boolean logic lecture), but maybe for scant type
theory.  Just enough to hand wave around type features.  Jumping off
points to the compilers course and getting people ready to port xv6 to
Rust

**** It's critical that the editor support works
- find definition is necessary to see how things work.
  convenient references when learning else no learning.

**** Debugging
https://smallcultfollowing.com/babysteps/blog/2018/09/21/office-hours-0-debugging-with-gdb/

"rr aspires to be your primary C/C++ debugging tool for Linux,
replacing — well, enhancing — gdb. You record a failure once, then
debug the recording, deterministically, as many times as you want. The
same execution is replayed every time."
https://rr-project.org

** ONLINE RUST COURSE BLUEPRINT
*** Facets of Ownership
Explicate mechanics. What is rust doing automatically?  Using move
explicitly. Using move, replace, take, these common examples and the
exercise will be to slowly build up the automation.  Desugar
rust. Then Resugar it.

*** Languages

http://lambda-the-ultimate.org/node/4389

*** Copy
**** Shallow Copy
Copy, does a shallow copy of the stack data, but maintains pointers to
the same heap memory.
Types with Drop trait implemented can't implement Copy.
**** Clone (python's deep_copy)

*** A rust implementation of the lambda-calculus?

*** Scopes are owners.
*** Methodology
**** motivate by introducing project. A gem to behold.
The gem principle of course

6.004 uses the beta as an artifact to contend with and build.
SICP uses scheme in the same way.

Students assemble a working minimal artifact by somewhere around the
3/5 point. Then deep thought is required about modifying the
artifact.

The goal isn’t to get people to the point where they can design and
build the artifact from scratch, rather it’s to deliver the ability to
use the tools and blueprints, to show them how to apply the tools to
the blueprints. Get familiar with the blueprints.

Introduce topics with top down wishful thinking to motivate.  Trace
down to necessary implementation.  build bottom up just in time to
maintain relevence.

Omni projects, a ~1 KLOC project.


*** RUST-O-RAMA bonanza.
own-o-rama part1
lifetime-o-rama part1
borr-ow-rama part1
closur-ama part1
*** What is the global allocator?
https://doc.rust-lang.org/edition-guide/rust-2018/platform-and-target-support/global-allocators.html
Divergent functions.


*** How to train a new Rust member?
https://www.reddit.com/r/rust/comments/cx90ib/how_to_train_a_new_rust_member/

**** notice
- name shadowing
  reuse names when returning ownership.

*** Lifetime Specifier
Rust Tutorial - Lifetime Specifiers Explained
https://www.youtube.com/watch?v=QoEX-Vu-R6k

*** existing rust courses
http://cs242.stanford.edu/f18/
https://www.cs.umd.edu/class/spring2018/cmsc330/
http://users.cs.northwestern.edu/~jesse/course/eecs396rust/
*** Links
**** discussion
https://news.ycombinator.com/item?id=13265758
https://jvns.ca/blog/2016/09/11/rustconf-keynote/
*** Builder Pattern mitigates verbose constructors of large structs
https://doc.rust-lang.org/1.0.0/style/ownership/builders.html
*** What's the diff?
https://www.apriorit.com/dev-blog/520-rust-vs-c-comparison
**** Topics
Zero cost abstractions
Move semantics, ownership, borrowing
Pointers
change checking
data races
polymorpism
runtime
FFI

*** Philosophy
Take the most learningest of learning moments one would find while
porting a C code base that hits all the highlights and set those up
like golf tees, paint the scenes in between, then the next hole. (a
golf course analogy isn't bad, maybe cliche though, narratives in
courses, lord of the rings would work too, video games have these
arcs, why not learning?, final bosses, etc)

So, a VM to get things up and running quickly.  People can SSH into
the VM if they want.  Backups should be included though, so a script
to pack up $HOME for backup on host machine, along with a package
list, etc.

Tests are local on the VM, perhaps design tests so that careful
inspection will provide clues to the solution but not too many clues
:)

make sure it's obvious why the pain is worth the upfront type systems
hurdles.

Lecture
*** Operational semantics, shortcut notation useful to speed understanding?
this is good, understand this
https://youtu.be/JbS8a-Ba0Ck?t=1010
https://arxiv.org/pdf/1903.00982.pdf
*** Closures
with pictures.
**** Closure has two things: 
- captures, the variables in the scope outside of the function
- 

**** sources
https://medium.com/swlh/understanding-closures-in-rust-21f286ed1759
https://ricardomartins.cc/2015/10/12/practical_differences_between_rust_closures_and_functions

** Lecture10
