rust-course-2019-07-19.html

<li><a id="org4d0d5ce"></a>Editor editions<br />
<div class="outline-text-5" id="text-1-14-2-2">
<p>
It couldn't be taught in emacs, that's for sure.  An editor with
shallow learning curve that covers the basics without being painful,
that's a TODO: find good easy editor.  Then tackle the underlying
theory, (like the boolean logic lecture), but maybe for scant type
theory.  Just enough to hand wave around type features.  Jumping off
points to the compilers course and getting people ready to port xv6 to
Rust
</p>
</div>
</li>

<li><a id="orgb46733b"></a>It's critical that the editor support works<br />
<div class="outline-text-5" id="text-1-14-2-3">
<ul class="org-ul">
<li>find definition is necessary to see how things work.
convenient references when learning else no learning.</li>
</ul>
</div>
</li>

<li><a id="orge7f179c"></a>Debugging<br />
<div class="outline-text-5" id="text-1-14-2-4">
<p>
<a href="https://smallcultfollowing.com/babysteps/blog/2018/09/21/office-hours-0-debugging-with-gdb/">https://smallcultfollowing.com/babysteps/blog/2018/09/21/office-hours-0-debugging-with-gdb/</a>
</p>

<p>
"rr aspires to be your primary C/C++ debugging tool for Linux,
replacing — well, enhancing — gdb. You record a failure once, then
debug the recording, deterministically, as many times as you want. The
same execution is replayed every time."
<a href="https://rr-project.org">https://rr-project.org</a>
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org881e3c2" class="outline-3">
<h3 id="org881e3c2"><span class="section-number-3">1.15</span> ONLINE RUST COURSE BLUEPRINT</h3>
<div class="outline-text-3" id="text-1-15">
</div>
<div id="outline-container-org1be1d60" class="outline-4">
<h4 id="org1be1d60"><span class="section-number-4">1.15.1</span> Facets of Ownership</h4>
<div class="outline-text-4" id="text-1-15-1">
<p>
Explicate mechanics. What is rust doing automatically?  Using move
explicitly. Using move, replace, take, these common examples and the
exercise will be to slowly build up the automation.  Desugar
rust. Then Resugar it.
</p>
</div>
</div>

<div id="outline-container-org349170f" class="outline-4">
<h4 id="org349170f"><span class="section-number-4">1.15.2</span> Languages</h4>
<div class="outline-text-4" id="text-1-15-2">
<p>
<a href="http://lambda-the-ultimate.org/node/4389">http://lambda-the-ultimate.org/node/4389</a>
</p>
</div>
</div>

<div id="outline-container-org086849c" class="outline-4">
<h4 id="org086849c"><span class="section-number-4">1.15.3</span> Copy</h4>
<div class="outline-text-4" id="text-1-15-3">
</div>
<ol class="org-ol">
<li><a id="org2fad571"></a>Shallow Copy<br />
<div class="outline-text-5" id="text-1-15-3-1">
<p>
Copy, does a shallow copy of the stack data, but maintains pointers to
the same heap memory.
Types with Drop trait implemented can't implement Copy.
</p>
</div>
</li>
<li><a id="org8f4b8fd"></a>Clone (python's deep<sub>copy</sub>)<br /></li>
</ol>
</div>

<div id="outline-container-org93322a1" class="outline-4">
<h4 id="org93322a1"><span class="section-number-4">1.15.4</span> A rust implementation of the lambda-calculus?</h4>
</div>

<div id="outline-container-org606cfd3" class="outline-4">
<h4 id="org606cfd3"><span class="section-number-4">1.15.5</span> Scopes are owners.</h4>
</div>
<div id="outline-container-org4976e95" class="outline-4">
<h4 id="org4976e95"><span class="section-number-4">1.15.6</span> Methodology</h4>
<div class="outline-text-4" id="text-1-15-6">
</div>
<ol class="org-ol">
<li><a id="org9c1caf6"></a>motivate by introducing project. A gem to behold.<br />
<div class="outline-text-5" id="text-1-15-6-1">
<p>
The gem principle of course
</p>

<p>
6.004 uses the beta as an artifact to contend with and build.
SICP uses scheme in the same way.
</p>

<p>
Students assemble a working minimal artifact by somewhere around the
3/5 point. Then deep thought is required about modifying the
artifact.
</p>

<p>
The goal isn’t to get people to the point where they can design and
build the artifact from scratch, rather it’s to deliver the ability to
use the tools and blueprints, to show them how to apply the tools to
the blueprints. Get familiar with the blueprints.
</p>

<p>
Introduce topics with top down wishful thinking to motivate.  Trace
down to necessary implementation.  build bottom up just in time to
maintain relevence.
</p>

<p>
Omni projects, a ~1 KLOC project.
</p>
</div>
</li>
</ol>
</div>


<div id="outline-container-orge841986" class="outline-4">
<h4 id="orge841986"><span class="section-number-4">1.15.7</span> RUST-O-RAMA bonanza.</h4>
<div class="outline-text-4" id="text-1-15-7">
<p>
own-o-rama part1
lifetime-o-rama part1
borr-ow-rama part1
closur-ama part1
</p>
</div>
</div>
<div id="outline-container-org3764fb4" class="outline-4">
<h4 id="org3764fb4"><span class="section-number-4">1.15.8</span> What is the global allocator?</h4>
<div class="outline-text-4" id="text-1-15-8">
<p>
<a href="https://doc.rust-lang.org/edition-guide/rust-2018/platform-and-target-support/global-allocators.html">https://doc.rust-lang.org/edition-guide/rust-2018/platform-and-target-support/global-allocators.html</a>
Divergent functions.
</p>
</div>
</div>


<div id="outline-container-org8cec42d" class="outline-4">
<h4 id="org8cec42d"><span class="section-number-4">1.15.9</span> How to train a new Rust member?</h4>
<div class="outline-text-4" id="text-1-15-9">
<p>
<a href="https://www.reddit.com/r/rust/comments/cx90ib/how_to_train_a_new_rust_member/">https://www.reddit.com/r/rust/comments/cx90ib/how_to_train_a_new_rust_member/</a>
</p>
</div>

<ol class="org-ol">
<li><a id="org2b54699"></a>notice<br />
<div class="outline-text-5" id="text-1-15-9-1">
<ul class="org-ul">
<li>name shadowing
reuse names when returning ownership.</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org757d8f9" class="outline-4">
<h4 id="org757d8f9"><span class="section-number-4">1.15.10</span> Lifetime Specifier</h4>
<div class="outline-text-4" id="text-1-15-10">
<p>
Rust Tutorial - Lifetime Specifiers Explained
<a href="https://www.youtube.com/watch?v=QoEX-Vu-R6k">https://www.youtube.com/watch?v=QoEX-Vu-R6k</a>
</p>
</div>
</div>

<div id="outline-container-org3fe5750" class="outline-4">
<h4 id="org3fe5750"><span class="section-number-4">1.15.11</span> existing rust courses</h4>
<div class="outline-text-4" id="text-1-15-11">
<p>
<a href="http://cs242.stanford.edu/f18/">http://cs242.stanford.edu/f18/</a>
<a href="https://www.cs.umd.edu/class/spring2018/cmsc330/">https://www.cs.umd.edu/class/spring2018/cmsc330/</a>
<a href="http://users.cs.northwestern.edu/~jesse/course/eecs396rust/">http://users.cs.northwestern.edu/~jesse/course/eecs396rust/</a>
</p>
</div>
</div>
<div id="outline-container-org935282a" class="outline-4">
<h4 id="org935282a"><span class="section-number-4">1.15.12</span> Links</h4>
<div class="outline-text-4" id="text-1-15-12">
</div>
<ol class="org-ol">
<li><a id="orgeb2a7da"></a>discussion<br />
<div class="outline-text-5" id="text-1-15-12-1">
<p>
<a href="https://news.ycombinator.com/item?id=13265758">https://news.ycombinator.com/item?id=13265758</a>
<a href="https://jvns.ca/blog/2016/09/11/rustconf-keynote/">https://jvns.ca/blog/2016/09/11/rustconf-keynote/</a>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgab6d69a" class="outline-4">
<h4 id="orgab6d69a"><span class="section-number-4">1.15.13</span> Builder Pattern mitigates verbose constructors of large structs</h4>
<div class="outline-text-4" id="text-1-15-13">
<p>
<a href="https://doc.rust-lang.org/1.0.0/style/ownership/builders.html">https://doc.rust-lang.org/1.0.0/style/ownership/builders.html</a>
</p>
</div>
</div>
<div id="outline-container-org3f3131e" class="outline-4">
<h4 id="org3f3131e"><span class="section-number-4">1.15.14</span> What's the diff?</h4>
<div class="outline-text-4" id="text-1-15-14">
<p>
<a href="https://www.apriorit.com/dev-blog/520-rust-vs-c-comparison">https://www.apriorit.com/dev-blog/520-rust-vs-c-comparison</a>
</p>
</div>
<ol class="org-ol">
<li><a id="org0799d04"></a>Topics<br />
<div class="outline-text-5" id="text-1-15-14-1">
<p>
Zero cost abstractions
Move semantics, ownership, borrowing
Pointers
change checking
data races
polymorpism
runtime
FFI
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org80eec4f" class="outline-4">
<h4 id="org80eec4f"><span class="section-number-4">1.15.15</span> Philosophy</h4>
<div class="outline-text-4" id="text-1-15-15">
<p>
Take the most learningest of learning moments one would find while
porting a C code base that hits all the highlights and set those up
like golf tees, paint the scenes in between, then the next hole. (a
golf course analogy isn't bad, maybe cliche though, narratives in
courses, lord of the rings would work too, video games have these
arcs, why not learning?, final bosses, etc)
</p>

<p>
So, a VM to get things up and running quickly.  People can SSH into
the VM if they want.  Backups should be included though, so a script
to pack up $HOME for backup on host machine, along with a package
list, etc.
</p>

<p>
Tests are local on the VM, perhaps design tests so that careful
inspection will provide clues to the solution but not too many clues
:)
</p>

<p>
make sure it's obvious why the pain is worth the upfront type systems
hurdles.
</p>

<p>
Lecture
</p>
</div>
</div>
<div id="outline-container-orgb2ddeeb" class="outline-4">
<h4 id="orgb2ddeeb"><span class="section-number-4">1.15.16</span> Operational semantics, shortcut notation useful to speed understanding?</h4>
<div class="outline-text-4" id="text-1-15-16">
<p>
this is good, understand this
<a href="https://youtu.be/JbS8a-Ba0Ck?t=1010">https://youtu.be/JbS8a-Ba0Ck?t=1010</a>
<a href="https://arxiv.org/pdf/1903.00982.pdf">https://arxiv.org/pdf/1903.00982.pdf</a>
</p>
</div>
</div>
<div id="outline-container-orga9b4a45" class="outline-4">
<h4 id="orga9b4a45"><span class="section-number-4">1.15.17</span> Closures</h4>
<div class="outline-text-4" id="text-1-15-17">
<p>
with pictures.
</p>
</div>
<ol class="org-ol">
<li><a id="org163a0a7"></a>Closure has two things:<br />
<div class="outline-text-5" id="text-1-15-17-1">
<ul class="org-ul">
<li>captures, the variables in the scope outside of the function</li>
<li></li>
</ul>
</div>
</li>

<li><a id="orgbe1afe0"></a>sources<br />
<div class="outline-text-5" id="text-1-15-17-2">
<p>
<a href="https://medium.com/swlh/understanding-closures-in-rust-21f286ed1759">https://medium.com/swlh/understanding-closures-in-rust-21f286ed1759</a>
<a href="https://ricardomartins.cc/2015/10/12/practical_differences_between_rust_closures_and_functions">https://ricardomartins.cc/2015/10/12/practical_differences_between_rust_closures_and_functions</a>
</p>
</div>
</li>
</ol>
</div>
</div>
