rust-course-2019-07-19.org
*** What's a trait?
It's like an interface.
*** What's an interface?
https://www.callicoder.com/golang-interfaces/ 

//It's like an object but it can't be instantiated 

It's a list of method declarations grouped by commonality.  A type is
said to implement an interface if the interfaces methods are
implemented for the type.

It's like C++ Abstract Class
Haskell type class

** Lecture Heap, aliasing, ownership and borrowing???
*** unvetted links
https://github.com/mre/idiomatic-rust

*** Objective
**** after this lecture you should:
- have a solid grasp of allocators and how their interface allows usage.
- understand the heap, issues of aliasing, ownership and borrowing.
- be able to port some basic imperative idioms to rust
- be able to decode rust error messages regarding ownership.

**** Common Errors

** Possible Omni Project 
*** Efficient mini scheme interpreter
Garbage Collector?
Challenges

*** Network
https://medium.com/coinmonks/understanding-ipfs-in-depth-5-6-what-is-libp2p-f8bf7724d452
**** Practical Networked Applications in Rust
https://github.com/pingcap/talent-plan/blob/master/rust/README.md

**** Enforcing protocol invarients with the borrow checker?

*** Emulator
Port a (C++ or C) (Beta or RiscV) cpu emulator to Rust.

Lab1 Control Structure Upgrades. 
Lab2 Debugging Rust
Lab3 Instruction set, Tests!
Lab4 Add a Mul instruction and profile it.
Lab5 Run linux on the emulator.




** Out of scope neat stuff!



https://github.com/RustPython/RustPython
*** Deep dives
https://smallcultfollowing.com/babysteps/
**** THEORY AND PAPERS
***** Non-lexical lifetimes: introduction (4/27/2016)
https://smallcultfollowing.com/babysteps/blog/2016/04/27/non-lexical-lifetimes-introduction/

***** Oxide: The Essence of Rust
https://arxiv.org/pdf/1903.00982.pdf
Places, provenances, types, kinds, shapes

****** references
Ownership Types For Flexible Alias Protection
https://www.cs.cornell.edu/courses/cs711/2005fa/papers/cpn-oopsla98.pdf

****** Kinds
******* Ordinary Types
******* Provenance

***** Ownership Types For Flexible Alias Protection
(a rust precursor)
https://www.cs.cornell.edu/courses/cs711/2005fa/papers/cpn-oopsla98.pdf
****** glossary
- CONTEXT = When a new object is created, it is alloted a new context
  which is considered to be inside that ob ject, and whose contents
  are deemed to be owned by that ob ject. In the program text, this
  partition is denoted by rep, the partition which holds the
  representation roughly a scheme frame

- OWNERSHIP TYPES = static types annotated with context declarations
  that represent object ownership

- RESTRICTED VISIBILITY = a property which limits the extent of object
  visibility

- REPRESENTATION CONTAINMENT = property which provides a notion of
  containment based on articulation points

- DOMINATOR = an articulator point

- VALUE OBJECTS = ??

****** representation containment



*** Hardware
Using Type-Level Programming in Rust to Make Safer Hardware Abstractions
https://blog.auxon.io/2019/10/25/type-level-registers/
*** Rust on microcontrollers
https://droogmic.github.io/microrust/

*** C2Rust compiler
https://c2rust.com

*** Helping the cause
implement for loop names in racer?
*** NEW IDEAS?
**** Restricted aliases
Restrict the graph distance of an aliased item. So, an object may
have field with type *C, but it can't have a field with type *B if B
has a field with type *C ?  

*** Scheme Segque
Implement lifetime observers in the basic scheme interpreter.
set! needs to be rethought.
when frames are removed from the environment lifetimes end
etc.

*** TOOLS
Pick an editor with good rust support. If you hit a snag then open an
issue so other people can learn.

Get the your editor working.


* UNSORTED 
https://blog.systems.ethz.ch/blog/2018/a-hammer-you-can-only-hold-by-the-handle.html

unimplemented!() is a time saver.

** Chunking Optimizations: Let the Knife Do the Work (AVX-512)
https://nullprogram.com/blog/2019/12/09/

** What's up with Cargo.lock?
https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html

** What's up with build scripts?
https://doc.rust-lang.org/cargo/reference/build-scripts.html

** Rust Guides
https://cheats.rs/2018-12-01/

