rust-course-2019-07-19.html

<div id="outline-container-orgec3ee9a" class="outline-3">
<h3 id="orgec3ee9a"><span class="section-number-3">1.16</span> Lecture10</h3>
<div class="outline-text-3" id="text-1-16">
</div>
<div id="outline-container-orgbd935eb" class="outline-4">
<h4 id="orgbd935eb"><span class="section-number-4">1.16.1</span> What's a trait?</h4>
<div class="outline-text-4" id="text-1-16-1">
<p>
It's like an interface.
</p>
</div>
</div>
<div id="outline-container-orge34dff7" class="outline-4">
<h4 id="orge34dff7"><span class="section-number-4">1.16.2</span> What's an interface?</h4>
<div class="outline-text-4" id="text-1-16-2">
<p>
<a href="https://www.callicoder.com/golang-interfaces/">https://www.callicoder.com/golang-interfaces/</a> 
</p>

<p>
//It's like an object but it can't be instantiated 
</p>

<p>
It's a list of method declarations grouped by commonality.  A type is
said to implement an interface if the interfaces methods are
implemented for the type.
</p>

<p>
It's like C++ Abstract Class
Haskell type class
</p>
</div>
</div>
</div>

<div id="outline-container-org2dc24a7" class="outline-3">
<h3 id="org2dc24a7"><span class="section-number-3">1.17</span> Lecture Heap, aliasing, ownership and borrowing???</h3>
<div class="outline-text-3" id="text-1-17">
</div>
<div id="outline-container-org89512db" class="outline-4">
<h4 id="org89512db"><span class="section-number-4">1.17.1</span> unvetted links</h4>
<div class="outline-text-4" id="text-1-17-1">
<p>
<a href="https://github.com/mre/idiomatic-rust">https://github.com/mre/idiomatic-rust</a>
</p>
</div>
</div>

<div id="outline-container-orgddbf0c7" class="outline-4">
<h4 id="orgddbf0c7"><span class="section-number-4">1.17.2</span> Objective</h4>
<div class="outline-text-4" id="text-1-17-2">
</div>
<ol class="org-ol">
<li><a id="orgb34c07a"></a>after this lecture you should:<br />
<div class="outline-text-5" id="text-1-17-2-1">
<ul class="org-ul">
<li>have a solid grasp of allocators and how their interface allows usage.</li>
<li>understand the heap, issues of aliasing, ownership and borrowing.</li>
<li>be able to port some basic imperative idioms to rust</li>
<li>be able to decode rust error messages regarding ownership.</li>
</ul>
</div>
</li>

<li><a id="org8cfffd9"></a>Common Errors<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org4070671" class="outline-3">
<h3 id="org4070671"><span class="section-number-3">1.18</span> Possible Omni Project</h3>
<div class="outline-text-3" id="text-1-18">
</div>
<div id="outline-container-org4089350" class="outline-4">
<h4 id="org4089350"><span class="section-number-4">1.18.1</span> Efficient mini scheme interpreter</h4>
<div class="outline-text-4" id="text-1-18-1">
<p>
Garbage Collector?
Challenges
</p>
</div>
</div>

<div id="outline-container-org60df91a" class="outline-4">
<h4 id="org60df91a"><span class="section-number-4">1.18.2</span> Network</h4>
<div class="outline-text-4" id="text-1-18-2">
<p>
<a href="https://medium.com/coinmonks/understanding-ipfs-in-depth-5-6-what-is-libp2p-f8bf7724d452">https://medium.com/coinmonks/understanding-ipfs-in-depth-5-6-what-is-libp2p-f8bf7724d452</a>
</p>
</div>
<ol class="org-ol">
<li><a id="orgba1e3ce"></a>Practical Networked Applications in Rust<br />
<div class="outline-text-5" id="text-1-18-2-1">
<p>
<a href="https://github.com/pingcap/talent-plan/blob/master/rust/README.md">https://github.com/pingcap/talent-plan/blob/master/rust/README.md</a>
</p>
</div>
</li>

<li><a id="orged6ec20"></a>Enforcing protocol invarients with the borrow checker?<br /></li>
</ol>
</div>

<div id="outline-container-org22f8101" class="outline-4">
<h4 id="org22f8101"><span class="section-number-4">1.18.3</span> Emulator</h4>
<div class="outline-text-4" id="text-1-18-3">
<p>
Port a (C++ or C) (Beta or RiscV) cpu emulator to Rust.
</p>

<p>
Lab1 Control Structure Upgrades. 
Lab2 Debugging Rust
Lab3 Instruction set, Tests!
Lab4 Add a Mul instruction and profile it.
Lab5 Run linux on the emulator.
</p>
</div>
</div>
</div>




<div id="outline-container-orgf91ca98" class="outline-3">
<h3 id="orgf91ca98"><span class="section-number-3">1.19</span> Out of scope neat stuff!</h3>
<div class="outline-text-3" id="text-1-19">
<p>
<a href="https://github.com/RustPython/RustPython">https://github.com/RustPython/RustPython</a>
</p>
</div>
<div id="outline-container-org4de833d" class="outline-4">
<h4 id="org4de833d"><span class="section-number-4">1.19.1</span> Deep dives</h4>
<div class="outline-text-4" id="text-1-19-1">
<p>
<a href="https://smallcultfollowing.com/babysteps/">https://smallcultfollowing.com/babysteps/</a>
</p>
</div>
<ol class="org-ol">
<li><a id="org3e1a6ea"></a>THEORY AND PAPERS<br />
<ol class="org-ol">
<li><a id="orgcdabcb5"></a>Non-lexical lifetimes: introduction (4/27/2016)<br />
<div class="outline-text-6" id="text-1-19-1-1-1">
<p>
<a href="https://smallcultfollowing.com/babysteps/blog/2016/04/27/non-lexical-lifetimes-introduction/">https://smallcultfollowing.com/babysteps/blog/2016/04/27/non-lexical-lifetimes-introduction/</a>
</p>
</div>
</li>

<li><a id="org3043354"></a>Oxide: The Essence of Rust<br />
<div class="outline-text-6" id="text-1-19-1-1-2">
<p>
<a href="https://arxiv.org/pdf/1903.00982.pdf">https://arxiv.org/pdf/1903.00982.pdf</a>
Places, provenances, types, kinds, shapes
</p>
</div>

<ol class="org-ol">
<li><a id="org402d03f"></a>references<br />
<div class="outline-text-7" id="text-1-19-1-1-2-1">
<p>
Ownership Types For Flexible Alias Protection
<a href="https://www.cs.cornell.edu/courses/cs711/2005fa/papers/cpn-oopsla98.pdf">https://www.cs.cornell.edu/courses/cs711/2005fa/papers/cpn-oopsla98.pdf</a>
</p>
</div>
</li>

<li><a id="orge88f4ad"></a>Kinds<br />
<ol class="org-ol">
<li><a id="orgadc87f9"></a>Ordinary Types<br /></li>
<li><a id="orgf91704b"></a>Provenance<br /></li>
</ol>
</li>
</ol>
</li>

<li><a id="org21d189d"></a>Ownership Types For Flexible Alias Protection<br />
<div class="outline-text-6" id="text-1-19-1-1-3">
<p>
(a rust precursor)
<a href="https://www.cs.cornell.edu/courses/cs711/2005fa/papers/cpn-oopsla98.pdf">https://www.cs.cornell.edu/courses/cs711/2005fa/papers/cpn-oopsla98.pdf</a>
</p>
</div>
<ol class="org-ol">
<li><a id="orge04a9ea"></a>glossary<br />
<div class="outline-text-7" id="text-1-19-1-1-3-1">
<ul class="org-ul">
<li>CONTEXT = When a new object is created, it is alloted a new context
which is considered to be inside that ob ject, and whose contents
are deemed to be owned by that ob ject. In the program text, this
partition is denoted by rep, the partition which holds the
representation roughly a scheme frame</li>

<li>OWNERSHIP TYPES = static types annotated with context declarations
that represent object ownership</li>

<li>RESTRICTED VISIBILITY = a property which limits the extent of object
visibility</li>

<li>REPRESENTATION CONTAINMENT = property which provides a notion of
containment based on articulation points</li>

<li>DOMINATOR = an articulator point</li>

<li>VALUE OBJECTS = ??</li>
</ul>
</div>
</li>

<li><a id="org10c356c"></a>representation containment<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>



<div id="outline-container-org6197aed" class="outline-4">
<h4 id="org6197aed"><span class="section-number-4">1.19.2</span> Hardware</h4>
<div class="outline-text-4" id="text-1-19-2">
<p>
Using Type-Level Programming in Rust to Make Safer Hardware Abstractions
<a href="https://blog.auxon.io/2019/10/25/type-level-registers/">https://blog.auxon.io/2019/10/25/type-level-registers/</a>
</p>
</div>
</div>
<div id="outline-container-orgf8b5f61" class="outline-4">
<h4 id="orgf8b5f61"><span class="section-number-4">1.19.3</span> Rust on microcontrollers</h4>
<div class="outline-text-4" id="text-1-19-3">
<p>
<a href="https://droogmic.github.io/microrust/">https://droogmic.github.io/microrust/</a>
</p>
</div>
</div>

<div id="outline-container-orgb38aab5" class="outline-4">
<h4 id="orgb38aab5"><span class="section-number-4">1.19.4</span> C2Rust compiler</h4>
<div class="outline-text-4" id="text-1-19-4">
<p>
<a href="https://c2rust.com">https://c2rust.com</a>
</p>
</div>
</div>

<div id="outline-container-org4b3b2a3" class="outline-4">
<h4 id="org4b3b2a3"><span class="section-number-4">1.19.5</span> Helping the cause</h4>
<div class="outline-text-4" id="text-1-19-5">
<p>
implement for loop names in racer?
</p>
</div>
</div>
<div id="outline-container-org98e3594" class="outline-4">
<h4 id="org98e3594"><span class="section-number-4">1.19.6</span> NEW IDEAS?</h4>
<div class="outline-text-4" id="text-1-19-6">
</div>
<ol class="org-ol">
<li><a id="orgc368120"></a>Restricted aliases<br />
<div class="outline-text-5" id="text-1-19-6-1">
<p>
Restrict the graph distance of an aliased item. So, an object may
have field with type *C, but it can't have a field with type *B if B
has a field with type *C ?  
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org6c4fdb2" class="outline-4">
<h4 id="org6c4fdb2"><span class="section-number-4">1.19.7</span> Scheme Segque</h4>
<div class="outline-text-4" id="text-1-19-7">
<p>
Implement lifetime observers in the basic scheme interpreter.
set! needs to be rethought.
when frames are removed from the environment lifetimes end
etc.
</p>
</div>
</div>

<div id="outline-container-org6763ea9" class="outline-4">
<h4 id="org6763ea9"><span class="section-number-4">1.19.8</span> TOOLS</h4>
<div class="outline-text-4" id="text-1-19-8">
<p>
Pick an editor with good rust support. If you hit a snag then open an
issue so other people can learn.
</p>

<p>
Get the your editor working.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org11c998d" class="outline-2">
<h2 id="org11c998d"><span class="section-number-2">2</span> UNSORTED</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://blog.systems.ethz.ch/blog/2018/a-hammer-you-can-only-hold-by-the-handle.html">https://blog.systems.ethz.ch/blog/2018/a-hammer-you-can-only-hold-by-the-handle.html</a>
</p>

<p>
unimplemented!() is a time saver.
</p>
</div>

<div id="outline-container-org2b0b28a" class="outline-3">
<h3 id="org2b0b28a"><span class="section-number-3">2.1</span> Chunking Optimizations: Let the Knife Do the Work (AVX-512)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://nullprogram.com/blog/2019/12/09/">https://nullprogram.com/blog/2019/12/09/</a>
</p>
</div>
</div>

<div id="outline-container-orgd420e5a" class="outline-3">
<h3 id="orgd420e5a"><span class="section-number-3">2.2</span> What's up with Cargo.lock?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html">https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html</a>
</p>
</div>
</div>

<div id="outline-container-org2e79acd" class="outline-3">
<h3 id="org2e79acd"><span class="section-number-3">2.3</span> What's up with build scripts?</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://doc.rust-lang.org/cargo/reference/build-scripts.html">https://doc.rust-lang.org/cargo/reference/build-scripts.html</a>
</p>
</div>
</div>

<div id="outline-container-org2240cf4" class="outline-3">
<h3 id="org2240cf4"><span class="section-number-3">2.4</span> Rust Guides</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://cheats.rs/2018-12-01/">https://cheats.rs/2018-12-01/</a>
</p>
</div>
</div>
