rust-course-2019-07-19.org
** The Periodic Table of Rust Types
http://cosmic.mearie.org/2014/01/periodic-table-of-rust-types/

** Ownership visualization
https://rufflewind.com/2017-02-15/rust-move-copy-borrow

* Rust: Fast and Safe.
highlight pitfalls.
how rust mitigates.
prereq: C, and one of [scheme | python | ruby | javascript | perl | ...]

What are we always asking?
What design commitments are being made?
What is the safe/fast tradeoff of the design choice?

Strategy for concept X.  What is X useful for? instead of testing to
see if we can remember what X is useful for, encourage us to
do useful thing with X -- many different ways.

Things change, sometimes *any* design to get a thing working is *the*
design. The goal is to pick a flexible design, then optimize.

Refactoring with rust/haskell/scala is much easier tha


Setting up rust for unoptimized builds to make sense of the assembly
with profiles
https://doc.rust-lang.org/book/ch14-01-release-profiles.html

** RefCell
meander through the 

https://stackoverflow.com/search?q=%5Brust%5D+refcell
https://stackoverflow.com/questions/58885209/when-should-i-use-smart-pointers/58885731#58885731
https://stackoverflow.com/questions/30831037/situations-where-cell-or-refcell-is-the-best-choice

*** How do I return a reference to something inside a RefCell without breaking encapsulation?



*** exercise ideas
interlace The rust book with exercises?
rust playground iframe

