rust-course-2019-07-19.html

<div id="outline-container-orgd448625" class="outline-3">
<h3 id="orgd448625"><span class="section-number-3">2.5</span> The Periodic Table of Rust Types</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<a href="http://cosmic.mearie.org/2014/01/periodic-table-of-rust-types/">http://cosmic.mearie.org/2014/01/periodic-table-of-rust-types/</a>
</p>
</div>
</div>

<div id="outline-container-org6c30531" class="outline-3">
<h3 id="org6c30531"><span class="section-number-3">2.6</span> Ownership visualization</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<a href="https://rufflewind.com/2017-02-15/rust-move-copy-borrow">https://rufflewind.com/2017-02-15/rust-move-copy-borrow</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org2899ad5" class="outline-2">
<h2 id="org2899ad5"><span class="section-number-2">3</span> Rust: Fast and Safe.</h2>
<div class="outline-text-2" id="text-3">
<p>
highlight pitfalls.
how rust mitigates.
prereq: C, and one of [scheme | python | ruby | javascript | perl | &#x2026;]
</p>

<p>
What are we always asking?
What design commitments are being made?
What is the safe/fast tradeoff of the design choice?
</p>

<p>
Strategy for concept X.  What is X useful for? instead of testing to
see if we can remember what X is useful for, encourage us to
do useful thing with X &#x2013; many different ways.
</p>

<p>
Things change, sometimes <b>any</b> design to get a thing working is <b>the</b>
design. The goal is to pick a flexible design, then optimize.
</p>

<p>
Refactoring with rust/haskell/scala is much easier tha
</p>


<p>
Setting up rust for unoptimized builds to make sense of the assembly
with profiles
<a href="https://doc.rust-lang.org/book/ch14-01-release-profiles.html">https://doc.rust-lang.org/book/ch14-01-release-profiles.html</a>
</p>
</div>

<div id="outline-container-org9e6fb75" class="outline-3">
<h3 id="org9e6fb75"><span class="section-number-3">3.1</span> RefCell</h3>
<div class="outline-text-3" id="text-3-1">
<p>
meander through the 
</p>

<p>
<a href="https://stackoverflow.com/search?q=%5Brust%5D+refcell">https://stackoverflow.com/search?q=[rust]+refcell</a>
<a href="https://stackoverflow.com/questions/58885209/when-should-i-use-smart-pointers/58885731#58885731">https://stackoverflow.com/questions/58885209/when-should-i-use-smart-pointers/58885731#58885731</a>
<a href="https://stackoverflow.com/questions/30831037/situations-where-cell-or-refcell-is-the-best-choice">https://stackoverflow.com/questions/30831037/situations-where-cell-or-refcell-is-the-best-choice</a>
</p>
</div>

<div id="outline-container-org9d180e5" class="outline-4">
<h4 id="org9d180e5"><span class="section-number-4">3.1.1</span> How do I return a reference to something inside a RefCell without breaking encapsulation?</h4>
</div>



<div id="outline-container-orgc5b1093" class="outline-4">
<h4 id="orgc5b1093"><span class="section-number-4">3.1.2</span> exercise ideas</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
interlace The rust book with exercises?
rust playground iframe
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc5cca64" class="outline-2">
<h2 id="orgc5cca64"><span class="section-number-2">4</span> Shared Borrows</h2>
</div>
<div id="outline-container-org8cabec5" class="outline-2">
<h2 id="org8cabec5"><span class="section-number-2">5</span> Mutable Borrows</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Derek Rhodes</p>
<p class="date">Created: 2019-12-31 Tue 15:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
